home buh/src/Documents/ПланПокупок/ПланПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланПокупок</name>
  <registerRecords>AccumulationRegister.ПотребностьВПродуктах</registerRecords>
  <attributes>
    <name>СуммаОбщая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПокупкаПродуктов</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Продукты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

home buh/src/Documents/ПланПокупок/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПокупкаПродуктовКоличествоПриИзменении(Элемент)
	 ТекущиеДанныеПокупкаПродуктов = Элементы.ПокупкаПродуктов.ТекущиеДанные;
	 ТекущиеДанныеПокупкаПродуктов.Итого = ТекущиеДанныеПокупкаПродуктов.Количество *ТекущиеДанныеПокупкаПродуктов.Цена;
	 
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПокупкаПродуктовЦенаПриИзменении(Элемент)
	 ТекущиеДанныеПокупкаПродуктов = Элементы.ПокупкаПродуктов.ТекущиеДанные;
	 ТекущиеДанныеПокупкаПродуктов.Итого = ТекущиеДанныеПокупкаПродуктов.Количество *ТекущиеДанныеПокупкаПродуктов.Цена;
	
КонецПроцедуры
